app/controllers/soat_controller.rb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."placa" = $1 LIMIT $2  [["placa", "euaeua"], ["LIMIT", 1]]
---
  def render_info_by_vehicle
    placa = params["placa"] if params["placa"].present?

    @vehicle = Vehicle.find_by(placa: placa)